PyeongTang/STM32_MobileRemoteCar/Project_Files/mobileRemoteCar/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DBG_TX_Pin GPIO_PIN_2
#define DBG_TX_GPIO_Port GPIOA
#define DBG_RX_Pin GPIO_PIN_3
#define DBG_RX_GPIO_Port GPIOA
#define BACK_EN_Pin GPIO_PIN_6
#define BACK_EN_GPIO_Port GPIOA
#define FRONT_L_IN1_Pin GPIO_PIN_7
#define FRONT_L_IN1_GPIO_Port GPIOA
#define BACK_IN1_Pin GPIO_PIN_10
#define BACK_IN1_GPIO_Port GPIOB
#define BT_STX_Pin GPIO_PIN_6
#define BT_STX_GPIO_Port GPIOC
#define FRONT_R_IN1_Pin GPIO_PIN_7
#define FRONT_R_IN1_GPIO_Port GPIOC
#define FRONT_L_EN_Pin GPIO_PIN_8
#define FRONT_L_EN_GPIO_Port GPIOC
#define FRONT_R_IN2_Pin GPIO_PIN_9
#define FRONT_R_IN2_GPIO_Port GPIOA
#define TRIG_Pin GPIO_PIN_10
#define TRIG_GPIO_Port GPIOA
#define BT_SRX_Pin GPIO_PIN_12
#define BT_SRX_GPIO_Port GPIOA
#define ECHO_Pin GPIO_PIN_3
#define ECHO_GPIO_Port GPIOB
#define BACK_IN2_Pin GPIO_PIN_4
#define BACK_IN2_GPIO_Port GPIOB
#define FRONT_R_EN_Pin GPIO_PIN_5
#define FRONT_R_EN_GPIO_Port GPIOB
#define FRONT_L_IN2_Pin GPIO_PIN_6
#define FRONT_L_IN2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
